#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/delca85-org/gh-actions-demo/runs/run-TdpYWASpnfHDrYnP

Waiting for the plan to start...

Terraform v1.0.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_sqs_queue.sqs[0]: Refreshing state... [id=https://sqs.eu-west-3.amazonaws.com/161959740628/master-terraform-sqs]
aws_sqs_queue.sqs[1]: Refreshing state... [id=https://sqs.eu-west-3.amazonaws.com/161959740628/master2-terraform-sqs]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_sqs_queue.sqs[1] has been changed
  ~ resource "aws_sqs_queue" "sqs" {
        id                                = "https://sqs.eu-west-3.amazonaws.com/161959740628/master2-terraform-sqs"
        name                              = "master2-terraform-sqs"
      + tags                              = {}
        # (11 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_sqs_queue.sqs[2] will be created
  + resource "aws_sqs_queue" "sqs" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "gsl-try-action-terraform-sqs"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @delca85, Action: `pull_request`*